riraosan/ESP32_LEDMatrix_Clock/src/main.cpp
void setAllPortLow()
{
    //digitalWrite(PORT_SE_IN, LOW);
    digitalWrite(PORT_AB_IN, LOW);
    digitalWrite(PORT_A3_IN, LOW);
    digitalWrite(PORT_A2_IN, LOW);
    digitalWrite(PORT_A1_IN, LOW);
    digitalWrite(PORT_A0_IN, LOW);
    digitalWrite(PORT_DG_IN, LOW);
    digitalWrite(PORT_CLK_IN, LOW);
    digitalWrite(PORT_WE_IN, LOW);
    digitalWrite(PORT_DR_IN, LOW);
    digitalWrite(PORT_ALE_IN, LOW);
}

void setAllPortHigh()
{
    digitalWrite(PORT_SE_IN, HIGH);
    digitalWrite(PORT_AB_IN, HIGH);
    digitalWrite(PORT_A3_IN, HIGH);
    digitalWrite(PORT_A2_IN, HIGH);
    digitalWrite(PORT_A1_IN, HIGH);
    digitalWrite(PORT_A0_IN, HIGH);
    digitalWrite(PORT_DG_IN, HIGH);
    digitalWrite(PORT_CLK_IN, HIGH);
    digitalWrite(PORT_WE_IN, HIGH);
    digitalWrite(PORT_DR_IN, HIGH);
    digitalWrite(PORT_ALE_IN, HIGH);
}

void PrintTime(String &str, int flag)
{
    char tmp_str[10] = {0};
    struct tm *tm;

    time_t t = time(NULL);
    tm = localtime(&t);

    if (flag == 0)
    {
        sprintf(tmp_str, "  %02d:%02d ", tm->tm_hour, tm->tm_min);
    }
    else
    {
        sprintf(tmp_str, "  %02d %02d ", tm->tm_hour, tm->tm_min);
    }

    str = tmp_str;
}

void printTimeLEDMatrix()
{
    uint8_t time_font_buf[8][16] = {0};
    String str;

    static int flag = 0;

    flag = ~flag;
    PrintTime(str, flag);

    uint8_t time_font_color[8] = {O, O, G, G, O, G, G, O};
    uint16_t sj_length = SFR.StrDirect_ShinoFNT_readALL(str, time_font_buf);
    printLEDMatrix(sj_length, time_font_buf, time_font_color);
}

void blink()
{
    printTimeLEDMatrix();
}

void connecting()
{
    uint16_t sj_length = 0;
    uint8_t _font_buf[8][16] = {0};
    uint8_t _font_color[8] = {O, O, O, O, O, O, O, O};

    static int num = 0;

    num = ~num;

    if (num)
    {
        sj_length = SFR.StrDirect_ShinoFNT_readALL("        ", _font_buf);
        printLEDMatrix(sj_length, _font_buf, _font_color);
    }
    else
    {
        sj_length = SFR.StrDirect_ShinoFNT_readALL("       .", _font_buf);
        printLEDMatrix(sj_length, _font_buf, _font_color);
    }
}

void initWiFi()
{
    wifiManager.setDebugOutput(true);

    if (!wifiManager.autoConnect(AP_NAME))
    {
        ESP.restart();
    }

    blinker.detach();

    Serial.println("WiFi Started");

    uint16_t sj_length = 0;
    uint8_t font_buf[32][16] = {0};
    uint8_t font_color1[32] = {G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G};

    sj_length = SFR.StrDirect_ShinoFNT_readALL(MSG_CONNECTED, font_buf);
    scrollLEDMatrix(sj_length, font_buf, font_color1, 30);

    sj_length = SFR.StrDirect_ShinoFNT_readALL("        " + WiFi.localIP().toString(), font_buf);
    scrollLEDMatrix(sj_length, font_buf, font_color1, 30);
}

void print_blank()
{
    uint8_t _font_buf[8][16] = {0};
    uint8_t _font_color[8] = {G, G, G, G, G, G, G, G};
    printLEDMatrix(8, _font_buf, _font_color);
}

void clearLEDMatrix()
{
    print_blank();
    print_blank();
}

void printStatic(String str)
{
    uint8_t _font_buf[8][16] = {0};
    uint8_t _font_color[8] = {G, G, G, G, G, G, G, G};

    if (str.length() < 9)
    {
        log_i("str : %s", str.c_str());
        uint16_t sj_length = SFR.StrDirect_ShinoFNT_readALL(str, _font_buf);
        printLEDMatrix(sj_length, _font_buf, _font_color);
    }
    else
    {
        log_e("couldn't set string. string length : %d", str.length());
    }
}

void initLCDMatrix()
{
    setAllPortOutput();

    digitalWrite(PORT_SE_IN, HIGH); //to change manual mode
    print_blank();
    print_blank();

    blinker.attach_ms(500, connecting);
}

void initSerial()
{
    Serial.begin(MONITOR_SPEED);
}

void initOta()
{
    ArduinoOTA.onStart([]() {
        String type;

        print_blank();

        clocker.detach();
        checker.detach();
        sensor_checker.detach();

        if (ArduinoOTA.getCommand() == U_FLASH)
        {
            type = "sketch";
            printStatic("sketch..");
        }
        else
        {
            type = "filesystem";
            printStatic("spiffs..");
        }
        log_d("Start updating : %s\r\n", type.c_str());
    });

    ArduinoOTA.onEnd([]() {
        printStatic("Uploaded");
        log_d("End");
        delay(2000);
    });

    ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
        String str = String(progress / (total / 100));

        log_d("Progress: %s%%", str.c_str());
        log_printf("\033[1F");

        str += "%";
        str.trim();

        //printStatic(str);
    });

    ArduinoOTA.onError([](ota_error_t error) {
        log_e("Error[%u]: ", error);
        printStatic("Error!!!");

        if (error == OTA_AUTH_ERROR)
        {
            log_e("Auth Failed");
        }
        else if (error == OTA_BEGIN_ERROR)
        {
            log_e("Begin Failed");
        }
        else if (error == OTA_CONNECT_ERROR)
        {
            log_e("Connect Failed");
        }
        else if (error == OTA_RECEIVE_ERROR)
        {
            log_e("Receive Failed");
        }
        else if (error == OTA_END_ERROR)
        {
            log_e("End Failed");
        }
    });

    ArduinoOTA.setMdnsEnabled(true);
    ArduinoOTA.setHostname(HOSTNAME);

    log_d("- Hostname : %s.local", ArduinoOTA.getHostname().c_str());

    ArduinoOTA.begin();
    log_d("- OTA Started");
}

bool check_clock_enable(uint8_t start_hour, uint8_t end_hour)
{
    time_t t = time(NULL);
    struct tm *tm = localtime(&t);

    log_i("HH:MM:SS = %02d:%02d:%02d", tm->tm_hour, tm->tm_min, tm->tm_sec);

    if (start_hour <= tm->tm_hour && tm->tm_hour < end_hour)
    {
        return true;
    }
    else
    {
        return false;
    }
}

void checkSensor()
{
    message = MESSAGE::MSG_COMMAND_SENSOR;
}

void stopClock()
{
    clocker.detach();
    sensor_checker.detach();
    active = false;
}

void startClock()
{
    clocker.attach_ms(500, blink);
    sensor_checker.attach(60, checkSensor);
    active = true;
}

void check_clock()
{
    bool IsClock = check_clock_enable(CLOCK_EN_S, CLOCK_EN_E);

