riraosan/ESP32_LEDMatrix_Clock/src/main.cpp
    if (IsClock == true)
    {
        if (active == false)
        {
            startClock();
            active = true;
        }
    }
    else
    {
        if (active == true)
        {
            stopClock();
            clearLEDMatrix();
            active = false;
        }
    }
}

String getServerInfo(String hostName, String uri)
{
    String jsonBody;
    HTTPClient http;

    log_d("Starting connection to %s.local Web server...", hostName.c_str());

    IPAddress ip = MDNS.queryHost(hostName);
    log_i("Hostname : %s IPaddress : %s", hostName.c_str(), ip.toString().c_str());

    http.begin(ip.toString(), 80, uri);
    int httpCode = http.GET();

    if (httpCode < 0)
    {
        log_e("Connection failed! code : %d", httpCode);
        jsonBody = "";
    }
    else
    {
        log_i("Connected to server! code : %d", httpCode);
        jsonBody = http.getString();
    }

    if (http.connected())
    {
        http.end();
    }

    return jsonBody;
}

void initClock()
{
    //Get NTP Time
    configTzTime("JST-9", "ntp.nict.jp", "ntp.jst.mfeed.ad.jp");

    delay(2000);

    check_clock();

    checker.attach(60, check_clock);
    //sensor_checker.attach(60 * 15, checkSensor);
    sensor_checker.attach(60, checkSensor);
}

void printTemperature()
{
    String temperature;
    char buffer[10] = {0};

    float _temperature = doc["temperatur"]; // 21.93

    snprintf(buffer, 9, "T:%4.1f*C", _temperature);
    temperature = buffer;
    log_i("temperature : [%s]", temperature.c_str());

    printStatic(temperature);

    delay(5000);
}

void printPressur()
{
    String pressur;
    char buffer[10] = {0};

    float _pressur = doc["pressur"]; // 1015.944

    snprintf(buffer, 9, "P:%6.1f", _pressur);
    pressur = buffer;
    log_i("pressur : [%s]", pressur.c_str());

    printStatic(pressur);

    delay(5000);
}

void printHumidity()
{
    String humidity;
    char buffer[10] = {0};

    float _humidity = doc["humidity"]; // 39.27832

    snprintf(buffer, 9, "H:%5.1f%%", _humidity);
    humidity = buffer;
    log_i("humidity : [%s]", humidity.c_str());

    printStatic(humidity);

    delay(5000);
}

void initHttpClient()
{
    String json = getServerInfo(DIST_HOSTNAME, APIURI);
    log_d("Body = %s", json.c_str());
}

void initFont()
{
    SFR.SPIFFS_Shinonome_Init3F(UTF8SJIS_file, Shino_Half_Font_file, dummy);
}

void getBME280Info()
{
    String json = getServerInfo(DIST_HOSTNAME, APIURI);
    if (json.isEmpty())
    {
        if (retry < 2)
        {
            retry++;
            checkSensor();
            delay(3000);
            return;
        }
        else
        {
            retry = 0;
            message = MESSAGE::MSG_COMMAND_NOTHING;
            return;
        }
    }
    else
    {
        retry = 0;

        stopClock();

        log_d("Body = %s", json.c_str());
        deserializeJson(doc, json);

        message = MESSAGE::MSG_COMMAND_TEMPERATURE;
    }
}

static void notifyCallback(BLERemoteCharacteristic *pBLERemoteCharacteristic, uint8_t *pData, size_t length, bool isNotify)
{
    log_i("Notify callback for characteristic %s of data length %d", pBLERemoteCharacteristic->getUUID().toString().c_str(), length);
}

class MyClientCallback : public BLEClientCallbacks
{
    void onConnect(BLEClient *pclient)
    {
        log_i("onConnect");
        message = MESSAGE::MSG_COMMAND_BLE_CONNECTED;
    }

    void onDisconnect(BLEClient *pclient)
    {
        log_i("onDisconnect");
        message = MESSAGE::MSG_COMMAND_BLE_DISCONNECTED;
    }
};

bool connectToServer(BLEAddress pAddress)
{
    log_i("Forming a connection to %s", pAddress.toString().c_str());

    BLEClient *pClient = BLEDevice::createClient();
    log_i(" - Created client");

    pClient->setClientCallbacks(new MyClientCallback());

    // Connect to the remove BLE Server.
    pClient->connect(pAddress);
    log_i(" - Connected to server");

    // Obtain a reference to the service we are after in the remote BLE server.
    BLERemoteService *pRemoteService = pClient->getService(serviceUUID);
    if (pRemoteService == nullptr)
    {
        log_i("Failed to find our service UUID: %s", serviceUUID.toString().c_str());
        return false;
    }
    log_i(" - Found our service");

    // Obtain a reference to the characteristic in the service of the remote BLE server.
    pRemoteCharacteristic = pRemoteService->getCharacteristic(charUUID);
    if (pRemoteCharacteristic == nullptr)
    {
        log_i("Failed to find our characteristic UUID: %s", charUUID.toString().c_str());
        return false;
    }

    log_i(" - Found our characteristic");

    // Read the value of the characteristic.
    std::string value = pRemoteCharacteristic->readValue();
    log_i("The characteristic value was: %s", value.c_str());

    pRemoteCharacteristic->registerForNotify(notifyCallback);

    return true;
}

/**
 * Scan for BLE servers and find the first one that advertises the service we are looking for.
 */
class MyAdvertisedDeviceCallbacks : public BLEAdvertisedDeviceCallbacks
{
    /**
   * Called for each advertising BLE server.
   */
    void onResult(BLEAdvertisedDevice advertisedDevice)
    {
        log_i("BLE Advertised Device found: %s", advertisedDevice.toString().c_str());

        // We have found a device, let us now see if it contains the service we are looking for.
        if (advertisedDevice.haveServiceUUID() && advertisedDevice.getServiceUUID().equals(serviceUUID))
        {
            log_i("Found our device!  address: %s", advertisedDevice.getAddress().toString().c_str());
            advertisedDevice.getScan()->stop();

            pServerAddress = new BLEAddress(advertisedDevice.getAddress());
            message = MESSAGE::MSG_COMMAND_BLE_DO_CONNECT;

        } // Found our server
        else
        {
            message = MESSAGE::MSG_COMMAND_BLE_NOT_FOUND;
        } // Not found our server
    }     // onResult
};        // MyAdvertisedDeviceCallbacks

static MyAdvertisedDeviceCallbacks *pAdvertisedDeviceCallback;

void initBLE()
{
    log_i("Starting Arduino BLE Client application...");

