riraosan/ESP32_LEDMatrix_Clock/src/main.cpp
    BLEDevice::deinit();

    BLEDevice::init("");
    // Retrieve a Scanner and set the callback we want to use to be informed when we
    // have detected a new device.  Specify that we want active scanning and start the
    // scan to run for 30 seconds.
    BLEScan *pBLEScan = BLEDevice::getScan();
    pAdvertisedDeviceCallback = new MyAdvertisedDeviceCallbacks();

    pBLEScan->setAdvertisedDeviceCallbacks(pAdvertisedDeviceCallback);
    pBLEScan->setActiveScan(true);
    pBLEScan->start(30); //waitting to find BLE server
}

void setup()
{
    initSerial();
    initFont();
    initLCDMatrix();
    initWiFi();
    initClock();
    initOta();
    initHttpClient();
    message = MESSAGE::MSG_COMMAND_BLE_INIT;
}

void loop()
{
    ArduinoOTA.handle();

    switch (message)
    {
    case MESSAGE::MSG_COMMAND_SENSOR:
        getBME280Info();
        break;
    case MESSAGE::MSG_COMMAND_TEMPERATURE:

        printTemperature();
        message = MESSAGE::MSG_COMMAND_HUMIDITY;
        break;
    case MESSAGE::MSG_COMMAND_HUMIDITY:

        printHumidity();
        message = MESSAGE::MSG_COMMAND_PRESSURE;
        break;
    case MESSAGE::MSG_COMMAND_PRESSURE:

        //printPressur();
        message = MESSAGE::MSG_COMMAND_CLOCK;
        break;
    case MESSAGE::MSG_COMMAND_CLOCK:

        startClock();
        message = MESSAGE::MSG_COMMAND_NOTHING;
        break;
    case MESSAGE::MSG_COMMAND_BLE_INIT:
        initBLE();
        break;
    case MESSAGE::MSG_COMMAND_BLE_DO_CONNECT:
        log_i("We wish to connect BLE Server. pServerAddress = 0x%x", pServerAddress);
        // We have scanned for and found the desired BLE Server with which we wish to connect.
        // Now we connect to it. Once we are connected we set "MSG_COMMAND_BLE_CONNECTED"
        if (connectToServer(*pServerAddress))
        {
            log_i("We are now connected to the BLE Server");
            message = MESSAGE::MSG_COMMAND_BLE_CONNECTED;
        }
        else
        {
            log_i("We have failed to connect to the server; there is nothing more we will do.");
            message = MESSAGE::MSG_COMMAND_BLE_DISCONNECTED;
        }
        break;
    case MESSAGE::MSG_COMMAND_BLE_CONNECTED:
        log_i("We are connected to a peer BLE Server");
        // If we are connected to a peer BLE Server, update the characteristic each time we are reached
        // with the current time since boot.

        //String newValue = "Time since boot: " + String(millis() / 1000);
        //log_i("Setting new characteristic value to \"%s\"", newValue.c_str());

        // Set the characteristic's value to be the array of bytes that is actually a string.
        //pRemoteCharacteristic->writeValue(newValue.c_str(), newValue.length());
        message = MESSAGE::MSG_COMMAND_NOTHING;
        break;
    case MESSAGE::MSG_COMMAND_BLE_DISCONNECTED:
        log_i("Disconnected our service");

        //TODO LED ON or OFF? To indicate for human.
        message = MESSAGE::MSG_COMMAND_BLE_INIT;
        break;
    case MESSAGE::MSG_COMMAND_BLE_NOT_FOUND:
        log_i("Not found our service");

        //TODO LED ON or OFF? To indicate for human.
        message = MESSAGE::MSG_COMMAND_NOTHING;
        break;
    case MESSAGE::MSG_COMMAND_NOTHING:
    default:; //nothing
    }

    yield();
}
